# NewCouplerTypeCreated Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarCouplerFailures..::..NewCouplerTypeCreated Property
BuiltInFailures..::..RebarCouplerFailures Class See Also
---
A new coupler type was automatically created to fit the bar diameters.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId NewCouplerTypeCreated { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NewCouplerTypeCreated As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ NewCouplerTypeCreated {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarCouplerFailures Class
Autodesk.Revit.DB Namespace